#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time    : 2022/1/10 16:55
# @Author  : Yan Kaifeng
# @Site    : 
# @File    : web_test_config.py
# @Software: PyCharm
import json

input_json = {
    "texts": "瓶窑老街和良诸遗址管理区周边安保服务项目服务合同第一条：本合同当事人甲方：（以下简称甲方）杭州市余杭区瓶窑镇人民政府乙方：（以下简称乙方）浙江民泰保安服务有限公司第二条：甲乙双方本着自愿平等、协商一致原则，根据（瓶窑老街和良诸遗址管理区周边安保服务项目、招标编号：HYZFCGDL-2020-001）公开招标的结果，甲方委托乙方对甲方的管理区域派遣服务外包人员进行协助管理服务，特订立本合同。第三条：服务类型：协助甲方对行政辖区进行相关的合法管理活动。第二章委托管理服务服务外包内容及范围第四条：服务范围及工作要求：协助瓶窑镇人民政府做好管理服务工作，达到甲方的工作要求。第三章委托管理期限及岗位需求和费用结算方式第五条：管理服务期限服务期限：：自2020年11月01日至2021年10月31日。服务期限：壹年。第六条：委托的岗位需求及费用结算方式：1、根据甲方的工作需要，配置61个岗位，服务外包费（含基本经费、考核经费、超时补贴费用）按中标价人民币陆佰零玖万柒任元整；小写：￥6097000元整结算。1.1、服务费（基本经费、超时补贴费）：配置61个岗位，每天8小时，每季服务费人民币壹佰伍拾壹万柒仟伍佰伍拾元整：小写：￥1517550.00元整，合计人民币陆佰零柒万零贰佰元整；小写：￥6070200.00元整。1.2、（考核经费）：每季度考核费人民币陆任柒佰元整；小写：￥6700.00元整，共计人民币贰万陆仟捌佰元整；小写：￥26800.00元整。2、服务费用包含所有服务管理人员的工资、社保、以及政策性文件规定及合同包含的所有风险、责任、合理利润等各项费用。3、费用支付及发票：按季度进行支付，季度第一个月按实付季度服务费用的70%，季度最后一个月按实支付季度服务费用的30%。先开票后支付。第四章双方权利义务第七条：甲方权利义务1、检查监督乙方管理工作的实施及甲方工作要求的执行情况。2、协助乙方协调处理合同生效前发生管理工作中所遗留问题。3、协助乙方对乙方派遣人员管理、培训、指导、宣传、教育。4、负责对乙方派驻现场的负责人和员工进行监督、考评；有权对不符合甲方要求的负责人、员工进行辞退、更换。5、要求乙方派遣服务外包人员年龄在35岁周岁以下，人员平均身高在170cm左右。6、甲方有权制定考核制度，对乙方进行考核，并根据考核结果支付服务外包费（考核制度另行商定）。7、乙方负责其派遣服务人员在工作中可能出现的人身安全事故及赔偿、财产损失等所有责任。8、乙方项目总负责人：杨定军，身份证号码：330125197402145917，联系电话：13605713300。第八条：乙方权利义务1、按照合同约定，提供高质量的管理服务，接受甲方监督。2、按照配置安排管理服务人员，如因甲方岗位变动、调整，，乙方应增加或减少管理服务人员。3、配合甲方做好区域的协助工作，职责明确、岗位明确。4、在工作中违反甲方制定的工作标准规定，应对其员工进行教育、警告、罚款、辞退。5、甲方须按时支付乙方管理服务费，如不能按时支付费用乙方有权终止服务合同。6、如甲乙双方合同约定范围内，发生人员违法活动等造成财产损失，经当地公安机关、相关部门，确认由于乙方人员工作失职所引起，乙方应承担相应责任。7、乙方项目总负责人：杨定军，身份证号码：330125197402145917，联系电话13605713300第五章管理服务要求标准第九条：：目标与任务运用先进的管理方法来管理与服务甲方，确保完成甲方工作目标。第十条：标准要求1、落实执行管理服务工作、作业标准，若与甲方标准发生冲突时按照甲方标准执行。管理区域内实行规定工作时间与应急服务，人员有明显的标志，各项工作措施落实。2、完成甲方交办的各项管理服务工作。3、乙方应承担外包人员的所有风险，与甲方无关。第六章违约责任第十一条：由于甲方未履行本合同第六条的约定，导致乙方不能完成管理目标的，乙方有权要求甲方在一定期限内解决，逾期未解决或协商未果的，，乙方有权终止合同，对乙方造成的经济损失，甲方按实赔偿。第十二条：由于乙方违反本合同第七条的约定，从而不能完成服务目标的，甲方有权要求乙方在一定期限整改，，逾期未整改或协商未果的，甲方有权终止合同，对甲方造成的经济损失，乙方应按实赔偿。第七章争议解决方式第十三条：在本合同执行中如发生争议，甲乙双方应通过友好协商解决，协商不成的，则通过甲方所在地法院相应的法律程序解决。第八章附则第十四条：考核办法见附件，本合同之附件为合同有效组成部分，具有同等法律效力。第十五条：本合同一式肆份，甲乙方各执贰份。本合同由甲乙双方代表签字或盖章后即时生效。甲方：（盖章）乙方（盖章）代表人或授权代表人（签字）代表人或授权代表人（签字签订日期：年月日签订日期：年月日00268",
    "lines_info_data": {
        "1": [
            {
                "end": 17,
                "start": 0,
                "txt": "瓶窑老街和良诸遗址管理区周边安保服务"
            },
            {
                "end": 23,
                "start": 18,
                "txt": "项目服务合同"
            },
            {
                "end": 33,
                "start": 24,
                "txt": "第一条：本合同当事人"
            },
            {
                "end": 57,
                "start": 34,
                "txt": "甲方：（以下简称甲方）杭州市余杭区瓶窑镇人民政府"
            },
            {
                "end": 80,
                "start": 58,
                "txt": "乙方：（以下简称乙方）浙江民泰保安服务有限公司"
            },
            {
                "end": 121,
                "start": 81,
                "txt": "第二条：甲乙双方本着自愿平等、协商一致原则，根据（瓶窑老街和良诸遗址管理区周边安保"
            },
            {
                "end": 174,
                "start": 122,
                "txt": "服务项目、招标编号：HYZFCGDL-2020-001）公开招标的结果，甲方委托乙方对甲方的管理区域派遣服"
            },
            {
                "end": 195,
                "start": 175,
                "txt": "务外包人员进行协助管理服务，特订立本合同。"
            },
            {
                "end": 225,
                "start": 196,
                "txt": "第三条：服务类型：协助甲方对行政辖区进行相关的合法管理活动。"
            },
            {
                "end": 243,
                "start": 226,
                "txt": "第二章委托管理服务服务外包内容及范围"
            },
            {
                "end": 257,
                "start": 244,
                "txt": "第四条：服务范围及工作要求："
            },
            {
                "end": 285,
                "start": 258,
                "txt": "协助瓶窑镇人民政府做好管理服务工作，达到甲方的工作要求。"
            },
            {
                "end": 306,
                "start": 286,
                "txt": "第三章委托管理期限及岗位需求和费用结算方式"
            },
            {
                "end": 316,
                "start": 307,
                "txt": "第五条：管理服务期限"
            },
            {
                "end": 355,
                "start": 317,
                "txt": "服务期限：：自2020年11月01日至2021年10月31日。服务期限：壹年。"
            },
            {
                "end": 374,
                "start": 356,
                "txt": "第六条：委托的岗位需求及费用结算方式："
            },
            {
                "end": 418,
                "start": 375,
                "txt": "1、根据甲方的工作需要，配置61个岗位，服务外包费（含基本经费、考核经费、超时补贴费用）"
            },
            {
                "end": 451,
                "start": 419,
                "txt": "按中标价人民币陆佰零玖万柒任元整；小写：￥6097000元整结算。"
            },
            {
                "end": 496,
                "start": 452,
                "txt": "1.1、服务费（基本经费、超时补贴费）：配置61个岗位，每天8小时，每季服务费人民币壹佰伍"
            },
            {
                "end": 544,
                "start": 497,
                "txt": "拾壹万柒仟伍佰伍拾元整：小写：￥1517550.00元整，合计人民币陆佰零柒万零贰佰元整；小写："
            },
            {
                "end": 558,
                "start": 545,
                "txt": "￥6070200.00元整。"
            },
            {
                "end": 606,
                "start": 559,
                "txt": "1.2、（考核经费）：每季度考核费人民币陆任柒佰元整；小写：￥6700.00元整，共计人民币贰万"
            },
            {
                "end": 628,
                "start": 607,
                "txt": "陆仟捌佰元整；小写：￥26800.00元整。"
            }
        ],
        "2": [
            {
                "end": 671,
                "start": 629,
                "txt": "2、服务费用包含所有服务管理人员的工资、社保、以及政策性文件规定及合同包含的所有风险、"
            },
            {
                "end": 684,
                "start": 672,
                "txt": "责任、合理利润等各项费用。"
            },
            {
                "end": 729,
                "start": 685,
                "txt": "3、费用支付及发票：按季度进行支付，季度第一个月按实付季度服务费用的70%，季度最后一个月"
            },
            {
                "end": 751,
                "start": 730,
                "txt": "按实支付季度服务费用的30%。先开票后支付。"
            },
            {
                "end": 760,
                "start": 752,
                "txt": "第四章双方权利义务"
            },
            {
                "end": 770,
                "start": 761,
                "txt": "第七条：甲方权利义务"
            },
            {
                "end": 798,
                "start": 771,
                "txt": "1、检查监督乙方管理工作的实施及甲方工作要求的执行情况。"
            },
            {
                "end": 826,
                "start": 799,
                "txt": "2、协助乙方协调处理合同生效前发生管理工作中所遗留问题。"
            },
            {
                "end": 854,
                "start": 827,
                "txt": "3、协助乙方对乙方派遣人员管理、培训、指导、宣传、教育。"
            },
            {
                "end": 896,
                "start": 855,
                "txt": "4、负责对乙方派驻现场的负责人和员工进行监督、考评；有权对不符合甲方要求的负责人、员"
            },
            {
                "end": 905,
                "start": 897,
                "txt": "工进行辞退、更换。"
            },
            {
                "end": 945,
                "start": 906,
                "txt": "5、要求乙方派遣服务外包人员年龄在35岁周岁以下，人员平均身高在170cm左右。"
            },
            {
                "end": 986,
                "start": 946,
                "txt": "6、甲方有权制定考核制度，对乙方进行考核，并根据考核结果支付服务外包费（考核制度另"
            },
            {
                "end": 991,
                "start": 987,
                "txt": "行商定）。"
            },
            {
                "end": 1033,
                "start": 992,
                "txt": "7、乙方负责其派遣服务人员在工作中可能出现的人身安全事故及赔偿、财产损失等所有责任。"
            },
            {
                "end": 1090,
                "start": 1034,
                "txt": "8、乙方项目总负责人：杨定军，身份证号码：330125197402145917，联系电话：13605713300。"
            },
            {
                "end": 1100,
                "start": 1091,
                "txt": "第八条：乙方权利义务"
            },
            {
                "end": 1127,
                "start": 1101,
                "txt": "1、按照合同约定，提供高质量的管理服务，接受甲方监督。"
            },
            {
                "end": 1170,
                "start": 1128,
                "txt": "2、按照配置安排管理服务人员，如因甲方岗位变动、调整，，乙方应增加或减少管理服务人员。"
            },
            {
                "end": 1196,
                "start": 1171,
                "txt": "3、配合甲方做好区域的协助工作，职责明确、岗位明确。"
            },
            {
                "end": 1235,
                "start": 1197,
                "txt": "4、在工作中违反甲方制定的工作标准规定，应对其员工进行教育、警告、罚款、辞退。"
            },
            {
                "end": 1272,
                "start": 1236,
                "txt": "5、甲方须按时支付乙方管理服务费，如不能按时支付费用乙方有权终止服务合同。"
            },
            {
                "end": 1316,
                "start": 1273,
                "txt": "6、如甲乙双方合同约定范围内，发生人员违法活动等造成财产损失，经当地公安机关、相关部门，"
            },
            {
                "end": 1342,
                "start": 1317,
                "txt": "确认由于乙方人员工作失职所引起，乙方应承担相应责任。"
            },
            {
                "end": 1397,
                "start": 1343,
                "txt": "7、乙方项目总负责人：杨定军，身份证号码：330125197402145917，联系电话13605713300"
            }
        ],
        "3": [
            {
                "end": 1408,
                "start": 1398,
                "txt": "第五章管理服务要求标准"
            },
            {
                "end": 1418,
                "start": 1409,
                "txt": "第九条：：目标与任务"
            },
            {
                "end": 1447,
                "start": 1419,
                "txt": "运用先进的管理方法来管理与服务甲方，确保完成甲方工作目标。"
            },
            {
                "end": 1455,
                "start": 1448,
                "txt": "第十条：标准要求"
            },
            {
                "end": 1497,
                "start": 1456,
                "txt": "1、落实执行管理服务工作、作业标准，若与甲方标准发生冲突时按照甲方标准执行。管理区域"
            },
            {
                "end": 1530,
                "start": 1498,
                "txt": "内实行规定工作时间与应急服务，人员有明显的标志，各项工作措施落实。"
            },
            {
                "end": 1548,
                "start": 1531,
                "txt": "2、完成甲方交办的各项管理服务工作。"
            },
            {
                "end": 1571,
                "start": 1549,
                "txt": "3、乙方应承担外包人员的所有风险，与甲方无关。"
            },
            {
                "end": 1578,
                "start": 1572,
                "txt": "第六章违约责任"
            },
            {
                "end": 1619,
                "start": 1579,
                "txt": "第十一条：由于甲方未履行本合同第六条的约定，导致乙方不能完成管理目标的，乙方有权要"
            },
            {
                "end": 1664,
                "start": 1620,
                "txt": "求甲方在一定期限内解决，逾期未解决或协商未果的，，乙方有权终止合同，对乙方造成的经济损失，"
            },
            {
                "end": 1671,
                "start": 1665,
                "txt": "甲方按实赔偿。"
            },
            {
                "end": 1712,
                "start": 1672,
                "txt": "第十二条：由于乙方违反本合同第七条的约定，从而不能完成服务目标的，甲方有权要求乙方"
            },
            {
                "end": 1757,
                "start": 1713,
                "txt": "在一定期限整改，，逾期未整改或协商未果的，甲方有权终止合同，对甲方造成的经济损失，乙方应按"
            },
            {
                "end": 1761,
                "start": 1758,
                "txt": "实赔偿。"
            },
            {
                "end": 1770,
                "start": 1762,
                "txt": "第七章争议解决方式"
            },
            {
                "end": 1811,
                "start": 1771,
                "txt": "第十三条：在本合同执行中如发生争议，甲乙双方应通过友好协商解决，协商不成的，则通过"
            },
            {
                "end": 1828,
                "start": 1812,
                "txt": "甲方所在地法院相应的法律程序解决。"
            },
            {
                "end": 1833,
                "start": 1829,
                "txt": "第八章附则"
            },
            {
                "end": 1871,
                "start": 1834,
                "txt": "第十四条：考核办法见附件，本合同之附件为合同有效组成部分，具有同等法律效力。"
            },
            {
                "end": 1913,
                "start": 1872,
                "txt": "第十五条：本合同一式肆份，甲乙方各执贰份。本合同由甲乙双方代表签字或盖章后即时生效。"
            }
        ],
        "4": [
            {
                "end": 1926,
                "start": 1914,
                "txt": "甲方：（盖章）乙方（盖章）"
            },
            {
                "end": 1951,
                "start": 1927,
                "txt": "代表人或授权代表人（签字）代表人或授权代表人（签字"
            },
            {
                "end": 1972,
                "start": 1952,
                "txt": "签订日期：年月日签订日期：年月日00268"
            }
        ]
    },
    "type": "keyword"
}

request_url = ["https://algo.ai-indeed.com/nlp/contract-review/general_check",
               "https://algo.ai-indeed.com/nlp/contract-review/purchase_check",
               "http://baisheng-order.ext.ii-ai.tech/general_check",
               "http://baisheng-order.ext.ii-ai.tech/purchase_check",
               "http://10.1.0.247:50421/general_check",
               "http://10.1.0.247:50421/purchase_check"
               ]

# 根据不同接口可提供一个样例
examples = json.dumps({
    # 线上
    "https://algo.ai-indeed.com/nlp/contract-review/general_check": input_json,
    "https://algo.ai-indeed.com/nlp/contract-review/purchase_check": input_json,
    # dev
    "http://baisheng-order.ext.ii-ai.tech/general_check": input_json,
    "http://baisheng-order.ext.ii-ai.tech/purchase_check": input_json,
    # 当前
    "http://10.1.0.247:50421/general_check": input_json,
    "http://10.1.0.247:50421/purchase_check": input_json

})
